In [3]:
import numpy as np
import pandas as pd

In [2]:
%%file dataset.csv
id,x,y,z
0,1,1,3
1,1,0,9
2,1,3,
3,2,0,10
4,1,,4
5,2,2,3

Overwriting dataset.csv

In [65]:
df = pd.read_csv('dataset.csv', )

In [66]:
df

   id  x    y     z
0   0  1  1.0   3.0
1   1  1  0.0   9.0
2   2  1  3.0   NaN
3   3  2  0.0  10.0
4   4  1  NaN   4.0
5   5  2  2.0   3.0

In [42]:
df = df.rename(columns={'x' : 'col_x', 'y' : 'col_y', 'z' : 'col_z'})

In [18]:
df

    col_x  col_y  col_z
id
0       1    1.0    3.0
1       1    0.0    9.0
2       1    3.0    NaN
3       2    0.0   10.0
4       1    NaN    4.0
5       2    2.0    3.0

In [43]:
df = df.fillna(0)
df = df.astype(int)

In [24]:
df

    col_x  col_y  col_z
id
0       1      1      3
1       1      0      9
2       1      3      0
3       2      0     10
4       1      0      4
5       2      2      3

In [44]:
df = df.drop([1, 3, 4], axis=0)

In [27]:
df

    col_x  col_y  col_z
id
0       1      1      3
2       1      3      0
5       2      2      3

In [45]:
zero_df = pd.DataFrame(np.zeros((2,3)), columns= \
                      ['col_x', 'col_y', 'col_z'\
                      ])

Object `pd.Dataframe` not found.

In [38]:
zero_df

   col_x  col_y  col_z
0    0.0    0.0    0.0
1    0.0    0.0    0.0

In [46]:
df = pd.concat([df, zero_df], axis = 0)

In [50]:
df

   col_x  col_y  col_z
0    0.0    0.0    0.0
1    0.0    0.0    0.0
0    1.0    1.0    3.0
2    1.0    3.0    0.0
5    2.0    2.0    3.0

In [53]:
df = df.sort_values('col_x', axis=0)

In [54]:
df

   col_x  col_y  col_z
0    0.0    0.0    0.0
1    0.0    0.0    0.0
0    1.0    1.0    3.0
2    1.0    3.0    0.0
5    2.0    2.0    3.0

In [55]:
df = df.astype(int)

In [56]:
df

   col_x  col_y  col_z
0      0      0      0
1      0      0      0
0      1      1      3
2      1      3      0
5      2      2      3

In [62]:
df.to_csv('output.csv', index = False)

In [63]:
!type output.csv

col_x,col_y,col_z
0,0,0
0,0,0
1,1,3
1,3,0
2,2,3